In [1]:
import pandas as pd

In [2]:
mark=[80,75,90,85]
labels=['maths','science','chemistry','physics']

In [3]:
ser=pd.Series(mark,labels)

In [4]:
ser

maths        80
science      75
chemistry    90
physics      85
dtype: int64

In [5]:
ser=pd.Series(data=mark,index=labels)

In [16]:
ser

maths        80
science      75
chemistry    90
physics      85
dtype: int64

In [17]:
type(ser)

pandas.core.series.Series

In [18]:
ser['maths']

80

In [19]:
ser[['maths','science']]

maths      80
science    75
dtype: int64

In [20]:
import numpy as np
p=np.arange(16).reshape(4,4)
labels=['a','b','c','d']
labels1=['A','B','C','D']

In [21]:
p

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [22]:
df=pd.DataFrame(p)

In [23]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [24]:
df=pd.DataFrame(p,index=labels,columns=labels1)

In [25]:
df

    A   B   C   D
a   0   1   2   3
b   4   5   6   7
c   8   9  10  11
d  12  13  14  15

In [26]:
df1 = pd.DataFrame([[1,2,3,4],[4,5,6,7],[8,9,10,11],[12,13,14,15]], index = "A B C D".split(),columns = "a b c d".split())

In [27]:
'A','B','C','D'.split()

('A', 'B', 'C', ['D'])

In [28]:
'a','b','c','d'.split()

('a', 'b', 'c', ['d'])

In [29]:
df1

    a   b   c   d
A   1   2   3   4
B   4   5   6   7
C   8   9  10  11
D  12  13  14  15

In [30]:
df1[['b','d']]

    b   d
A   2   4
B   5   7
C   9  11
D  13  15

In [31]:
df1.loc['A']

a    1
b    2
c    3
d    4
Name: A, dtype: int64

In [32]:
df1.loc['C']

a     8
b     9
c    10
d    11
Name: C, dtype: int64

In [33]:
df1.iloc[0]

a    1
b    2
c    3
d    4
Name: A, dtype: int64

In [34]:
df1['new']=df1['a']+df1['b']

In [35]:
df1

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [38]:
df1['new2']=[1,2,4,6]

In [39]:
df1

    a   b   c   d  new  new2
A   1   2   3   4    3     1
B   4   5   6   7    9     2
C   8   9  10  11   17     4
D  12  13  14  15   25     6

In [40]:
df1.drop('new2',axis=1)

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [47]:
df1

    a   b   c   d  new  new2
A   1   2   3   4    3     1
B   4   5   6   7    9     2
C   8   9  10  11   17     4
D  12  13  14  15   25     6

In [41]:
df1.drop('new2',axis=1,inplace=True)

In [42]:
df1

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [43]:
df1.drop('D')

   a  b   c   d  new
A  1  2   3   4    3
B  4  5   6   7    9
C  8  9  10  11   17

In [44]:
df1

    a   b   c   d  new
A   1   2   3   4    3
B   4   5   6   7    9
C   8   9  10  11   17
D  12  13  14  15   25

In [45]:
df1.drop('D',inplace=True)

In [46]:
df1

   a  b   c   d  new
A  1  2   3   4    3
B  4  5   6   7    9
C  8  9  10  11   17

In [47]:
df1.reset_index()

  index  a  b   c   d  new
0     A  1  2   3   4    3
1     B  4  5   6   7    9
2     C  8  9  10  11   17

In [51]:
newind='CA NY WT'.split()

In [53]:
newind

['CA', 'NY', 'WT']

In [54]:
df1['newindex']=newind

In [55]:
df1

   a  b   c   d  new newindex
A  1  2   3   4    3       CA
B  4  5   6   7    9       NY
C  8  9  10  11   17       WT

In [56]:
df1.set_index('newindex',inplace=True)

In [57]:
df1

          a  b   c   d  new
newindex
CA        1  2   3   4    3
NY        4  5   6   7    9
WT        8  9  10  11   17

In [58]:
df1.head() #will return first 5 rows

          a  b   c   d  new
newindex
CA        1  2   3   4    3
NY        4  5   6   7    9
WT        8  9  10  11   17

In [59]:
df1.tail() #will return last 5 rows of data set

          a  b   c   d  new
newindex
CA        1  2   3   4    3
NY        4  5   6   7    9
WT        8  9  10  11   17

In [62]:
df1.tail(2) # last two will return

          a  b   c   d  new
newindex
NY        4  5   6   7    9
WT        8  9  10  11   17

In [64]:
df1['a'].unique() #it will display all the unique elements in the coloumn

array([1, 4, 8], dtype=int64)

In [66]:
df1['a'].value_counts() # how many times element is repeated

8    1
1    1
4    1
Name: a, dtype: int64

In [67]:
df1.describe() #describe deals with all statascital data

              a         b          c          d        new
count  3.000000  3.000000   3.000000   3.000000   3.000000
mean   4.333333  5.333333   6.333333   7.333333   9.666667
std    3.511885  3.511885   3.511885   3.511885   7.023769
min    1.000000  2.000000   3.000000   4.000000   3.000000
25%    2.500000  3.500000   4.500000   5.500000   6.000000
50%    4.000000  5.000000   6.000000   7.000000   9.000000
75%    6.000000  7.000000   8.000000   9.000000  13.000000
max    8.000000  9.000000  10.000000  11.000000  17.000000

In [69]:
df1.info() #info about data types in the dataframe

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, CA to WT
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
 3   d       3 non-null      int64
 4   new     3 non-null      int64
dtypes: int64(5)
memory usage: 224.0+ bytes

In [70]:
def add(ip1,ip2,ip3):
    c=ip1+ip2+ip3

In [72]:
add(6,7) #so we need to handle missing values

TypeError: add() missing 1 required positional argument: 'ip3'

Ways of replacing missing values
1.To replace the missing values with mean
2,replace it with mode
3.replace it with median
4.your own

In [76]:
df3=pd.DataFrame({'A':[1,2,np.NaN],
                 'B':[5,np.NaN,np.NaN],
                 'C':[1,2,3]})

In [99]:
df3

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [100]:
df3.isnull().any #to cehck is there any null values in list or not

<bound method DataFrame.any of        A      B      C
0  False  False  False
1  False   True  False
2   True   True  False>

In [101]:
df3.isnull().any()

A     True
B     True
C    False
dtype: bool

In [102]:
df3.isnull().sum()  #it will display how many null values are in each coloumn

A    1
B    2
C    0
dtype: int64

In [103]:
df3.dropna()

     A    B  C
0  1.0  5.0  1

In [104]:
df3.dropna(axis=1)

   C
0  1
1  2
2  3

In [105]:
df3.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [106]:
df3.dropna(thresh=2,axis=1)

     A  C
0  1.0  1
1  2.0  2
2  NaN  3

In [109]:
df3.fillna(value=60) #replacing null data with your own data

      A     B  C
0   1.0   5.0  1
1   2.0  60.0  2
2  60.0  60.0  3

In [110]:
df3['A'].fillna(df3['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [112]:
df3['B'].fillna(df3['B'].mean())

0    5.0
1    5.0
2    5.0
Name: B, dtype: float64

In [114]:
df3['A'].fillna(df3['A'].median())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [117]:
p=df3['A'].mode()

In [118]:
p

0    1.0
1    2.0
dtype: float64

In [119]:
p[1]

2.0

In [123]:
df3['A'].fillna(df3['A'].mode()[0])

0    1.0
1    2.0
2    1.0
Name: A, dtype: float64

In [124]:
df4=pd.DataFrame(["India",np.nan,'india','Australia','us','canada'],columns=['country'])

In [125]:
df4

     country
0      India
1        NaN
2      india
3  Australia
4         us
5     canada

In [127]:
q=df4['country'].mode()

In [128]:
q

0    Australia
1        India
2       canada
3        india
4           us
dtype: object

In [129]:
q[0]

'Australia'

In [132]:
df4['country'].fillna(df4['country'].mode()[0])

0        India
1    Australia
2        india
3    Australia
4           us
5       canada
Name: country, dtype: object

In [133]:
df4

     country
0      India
1        NaN
2      india
3  Australia
4         us
5     canada

In [135]:
#inorder to replace the changes we did we need to make use of inplace
df4['country'].fillna(df4['country'].mode()[0],inplace=True)

In [136]:
df4

     country
0      India
1  Australia
2      india
3  Australia
4         us
5     canada

when to use?
mean- ideal condition is if columns data is in a range -age(1-20)
median()-lot of variation salary(1000-10000000)
mode- for textual data

In [137]:
data = pd.DataFrame({'1':  ['h', 'e','l','l','o',np.NaN,'n','a','i','t'],
        '2':  ['h', 'e','l','l','o','n','a','i',np.NaN,'t'],
        '3':  ['h', 'e','l','l','o',np.NaN,'n','a','i','t'],
        '4':  ['h', 'e','l','l','o',np.NaN,'n','a','i','t'],
        '5':  ['h', 'e',np.NaN,'l','o','n','a','i','t','k'],
        '6':  ['h',np.NaN,'l','l','o','k','n','a','i','t'],
        '7':  ['h', 'e','l','l','o',np.NaN,'n','a','i','t']})

In [138]:
data

     1    2    3    4    5    6    7
0    h    h    h    h    h    h    h
1    e    e    e    e    e  NaN    e
2    l    l    l    l  NaN    l    l
3    l    l    l    l    l    l    l
4    o    o    o    o    o    o    o
5  NaN    n  NaN  NaN    n    k  NaN
6    n    a    n    n    a    n    n
7    a    i    a    a    i    a    a
8    i  NaN    i    i    t    i    i
9    t    t    t    t    k    t    t

In [139]:
data={"Name":["Milky bar","5-star","Fudge","Mars","Diary milk","M&M","Gems","Foxes","Milky way","Tobelrone"],"Price":[20,10,50,70,45,76,np.NaN,np.NaN,67,80],'Discount':[2,5,10,7,5,2,np.NaN,np.NaN,5,2],'Rating':[5,2,8,5,0,10,7,8,3,10],"col-05":['a','b','c',np.NaN,'d','e','a','a','a','b'],"col-06":[10,9,8,7,6,5,4,3,2,1],"col07":[5,5,np.NaN,7,np.NaN,np.NaN,np.NaN,np.NaN,np.NaN,np.NaN]}

In [140]:
data

{'Name': ['Milky bar',
  '5-star',
  'Fudge',
  'Mars',
  'Diary milk',
  'M&M',
  'Gems',
  'Foxes',
  'Milky way',
  'Tobelrone'],
 'Price': [20, 10, 50, 70, 45, 76, nan, nan, 67, 80],
 'Discount': [2, 5, 10, 7, 5, 2, nan, nan, 5, 2],
 'Rating': [5, 2, 8, 5, 0, 10, 7, 8, 3, 10],
 'col-05': ['a', 'b', 'c', nan, 'd', 'e', 'a', 'a', 'a', 'b'],
 'col-06': [10, 9, 8, 7, 6, 5, 4, 3, 2, 1],
 'col07': [5, 5, nan, 7, nan, nan, nan, nan, nan, nan]}

In [141]:
df=pd.DataFrame(data)

In [142]:
df

         Name  Price  Discount  Rating col-05  col-06  col07
0   Milky bar   20.0       2.0       5      a      10    5.0
1      5-star   10.0       5.0       2      b       9    5.0
2       Fudge   50.0      10.0       8      c       8    NaN
3        Mars   70.0       7.0       5    NaN       7    7.0
4  Diary milk   45.0       5.0       0      d       6    NaN
5         M&M   76.0       2.0      10      e       5    NaN
6        Gems    NaN       NaN       7      a       4    NaN
7       Foxes    NaN       NaN       8      a       3    NaN
8   Milky way   67.0       5.0       3      a       2    NaN
9   Tobelrone   80.0       2.0      10      b       1    NaN

In [143]:
df.isnull().any()
df['Price'].fillna(df['Price'].mean(),inplace=True)
df['col07'].fillna(df['col07'].median(),inplace=True)
df['col-05'].fillna(df['col-05'].mode()[0],inplace=True)

In [144]:
df

         Name  Price  Discount  Rating col-05  col-06  col07
0   Milky bar  20.00       2.0       5      a      10    5.0
1      5-star  10.00       5.0       2      b       9    5.0
2       Fudge  50.00      10.0       8      c       8    5.0
3        Mars  70.00       7.0       5      a       7    7.0
4  Diary milk  45.00       5.0       0      d       6    5.0
5         M&M  76.00       2.0      10      e       5    5.0
6        Gems  52.25       NaN       7      a       4    5.0
7       Foxes  52.25       NaN       8      a       3    5.0
8   Milky way  67.00       5.0       3      a       2    5.0
9   Tobelrone  80.00       2.0      10      b       1    5.0

In [145]:
#dataset=pd.read_csv(r"path")  reading data set